In [81]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [82]:
item_to_id=pd.read_csv('item_to_id.csv')
df=pd.read_csv('purchase_history.csv')

In [3]:
item_to_id.head()

         Item_name  Item_id
0           coffee       43
1              tea       23
2            juice       38
3             soda        9
4  sandwich loaves       39

In [9]:
#purchase history
df.head()

   user_id                                                 id
0   222087                                              27,26
1  1343649                                            6,47,17
2   404134                       18,12,23,22,27,43,38,20,35,1
3  1110200                                 9,23,2,20,26,47,37
4   224107  31,18,5,13,1,21,48,16,26,2,44,32,20,37,42,35,4...

In [83]:
df['id']=df.id.str.split(',')

# question 1- the customer who bought the most items overall in her lifetime

In [84]:
import collections
from collections import Counter
def count_cities(df):
    c = Counter(i for id in df.id for i in id)
    return pd.Series(c)
search_by_user = df.groupby("user_id").apply(count_cities).unstack(fill_value=0)

In [85]:
#get user with most items purchased
def get(data):
    data['total']=data[data.columns].sum(axis=1)
    return data.nlargest(1, 'total')['total']

In [86]:
print(get(search_by_user))

user_id
269335    72
Name: total, dtype: int64

user 269335 has purchased the highest number of items in his/her lifetime

# question 2- for each item, the customer who bought that product the most

In [132]:
search_by_user.nlargest(1,'9')['9']

user_id
269335    4
Name: 9, dtype: int64

In [124]:
for column in search_by_user.columns:
    h=search_by_user.nlargest(1,column)[column]
    #merge_value = pd.merge(h,search_by_user.reset_index(), on='user_id', how='left')
    print(h,column)

user_id
31625    4
Name: 1, dtype: int64 1
user_id
618914    4
Name: 10, dtype: int64 10
user_id
367872    3
Name: 11, dtype: int64 11
user_id
557904    3
Name: 12, dtype: int64 12
user_id
653800    4
Name: 13, dtype: int64 13
user_id
172120    3
Name: 14, dtype: int64 14
user_id
143741    3
Name: 15, dtype: int64 15
user_id
73071    3
Name: 16, dtype: int64 16
user_id
366155    4
Name: 17, dtype: int64 17
user_id
917199    5
Name: 18, dtype: int64 18
user_id
31625    3
Name: 19, dtype: int64 19
user_id
31625    5
Name: 2, dtype: int64 2
user_id
885474    4
Name: 20, dtype: int64 20
user_id
884172    4
Name: 21, dtype: int64 21
user_id
1199670    4
Name: 22, dtype: int64 22
user_id
920002    5
Name: 23, dtype: int64 23
user_id
189913    3
Name: 24, dtype: int64 24
user_id
68282    4
Name: 25, dtype: int64 25
user_id
967573    4
Name: 26, dtype: int64 26
user_id
956666    4
Name: 27, dtype: int64 27
user_id
204624    4
Name: 28, dtype: int64 28
user_id
394348    4
Name: 29, dtype: int64 29
user_id
154960    4
Name: 3, dtype: int64 3
user_id
21779    2
Name: 30, dtype: int64 30
user_id
289360    3
Name: 31, dtype: int64 31
user_id
109578    4
Name: 32, dtype: int64 32
user_id
1310207    3
Name: 33, dtype: int64 33
user_id
305916    4
Name: 34, dtype: int64 34
user_id
450482    3
Name: 35, dtype: int64 35
user_id
269335    4
Name: 36, dtype: int64 36
user_id
46757    4
Name: 37, dtype: int64 37
user_id
255546    4
Name: 38, dtype: int64 38
user_id
599172    5
Name: 39, dtype: int64 39
user_id
5289    3
Name: 4, dtype: int64 4
user_id
38872    4
Name: 40, dtype: int64 40
user_id
133355    4
Name: 41, dtype: int64 41
user_id
80215    4
Name: 42, dtype: int64 42
user_id
996380    4
Name: 43, dtype: int64 43
user_id
31625    4
Name: 44, dtype: int64 44
user_id
1198106    5
Name: 45, dtype: int64 45
user_id
1218645    4
Name: 46, dtype: int64 46
user_id
384935    4
Name: 47, dtype: int64 47
user_id
335841    3
Name: 48, dtype: int64 48
user_id
217277    3
Name: 5, dtype: int64 5
user_id
334664    4
Name: 6, dtype: int64 6
user_id
175865    3
Name: 7, dtype: int64 7
user_id
151926    3
Name: 8, dtype: int64 8
user_id
269335    4
Name: 9, dtype: int64 9
user_id
269335    72
Name: total, dtype: int64 total